# Creating DataFrame

In [1]:
import pandas as pd

In [6]:
x = pd.DataFrame({"Name": ["Vinay","Sahil","Pankaj"],
                  "Class": [10,12,11],
                  "City":["Delhi","Pune","Bangalore"]})

In [7]:
x

     Name  Class       City
0   Vinay     10      Delhi
1   Sahil     12       Pune
2  Pankaj     11  Bangalore

# Change any value
###### we change name "Vinay" to "Tom"

In [10]:
x["Name"].replace("Vinay","Tom",inplace = True)

In [11]:
x

     Name  Class       City
0     Tom     10      Delhi
1   Sahil     12       Pune
2  Pankaj     11  Bangalore

# Add new column in existing dataframe

In [15]:
column = ["B","A","C"]

In [16]:
x["Grade"] = column

In [17]:
x

     Name  Class       City Grade
0     Tom     10      Delhi     B
1   Sahil     12       Pune     A
2  Pankaj     11  Bangalore     C